Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: PEP: 226 Title: Python 2.1 Release Schedule Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Informational Created: 16-Oct-2000 Python-Version: 2.1 Post-History:
ko: PEP: 226 Title: 파이썬 2.1 릴리스 일정 Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Informational Created: 16-Oct-2000 Python-Version: 2.1 Post-History:

source: PEP: 227 Title: Statically Nested Scopes Version: $Revision$ Last-Modified: $Date$ Author: jeremy@alum.mit.edu (Jeremy Hylton) Status: Final Type: Standards Track Created: 01-Nov-2000 Python-Version: 2.1 Post-History:
ko: PEP: 227 Title: 정적으로 중첩된 범위 Version: $Revision$ Last-Modified: $Date$ Author: jeremy@alum.mit.edu (Jeremy Hylton) Status: Final Type: Standards Track Created: 01-Nov-2000 Python-Version: 2.1 Post-History:

source: PEP: 229 Title: Using Distutils to Build Python Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Final Type: Standards Track Created: 16-Nov-2000 Post-History:
ko: PEP: 229 Title: Distutils를 사용하여 파이썬을 빌드 Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Final Type: Standards Track Created: 16-Nov-2000 Post-History:

source: PEP: 230 Title: Warning Framework Version: $Revision$ Last-Modified: $Date$ Author: guido@python.org (Guido van Rossum) Status: Final Type: Standards Track Created: Python-Version: 2.1 Post-History: 05-Nov-2000
ko: PEP: 230 Title: 경고 프레임워크 Version: $Revision$ Last-Modified: $Date$ Author: guido@python.org (Guido van Rossum) Status: Final Type: Standards Track Created: Python-Version: 2.1 Post-History: 05-Nov-2000

source: PEP: 3 Title: Guidelines for Handling Bug Reports Version: $Revision$ Last-Modified: $Date$ Author: jeremy@alum.mit.edu (Jeremy Hylton) Status: Withdrawn Type: Process Created: 25-Sep-2000 Post-History:
ko: PEP: 3 Title: 버그 리포트 처리 안내 Version: $Revision$ Last-Modified: $Date$ Author: jeremy@alum.mit.edu (Jeremy Hylton) Status: Withdrawn Type: Process Created: 25-Sep-2000 Post-History:

source: PEP: 4 Title: Deprecation of Standard Modules Version: $Revision$ Last-Modified: $Date$ Author: Martin von Löwis <martin@v.loewis.de> Status: Active Type: Process Created: 1-Oct-2000 Post-History:
ko: PEP: 4 Title: 표준 모듈의 금지 Version: $Revision$ Last-Modified: $Date$ Author: Martin von Löwis <martin@v.loewis.de> Status: Active Type: Process Created: 1-Oct-2000 Post-History:

source: PEP: 42 Title: Feature Requests Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Process Created: 12-Sep-2000 Post-History:
ko: PEP: 42 Title: 기능 요청 Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Process Created: 12-Sep-2000 Post-History:

source: PEP: 5 Title: Guidelines for Language Evolution Version: $Revision$ Last-Modified: $Date$ Author: paul@prescod.net (Paul Prescod) Status: Active Type: Process Created: 26-Oct-2000 Post-History:
ko: PEP: 5 Title: 언어 진화 안내 Version: $Revision$ Last-Modified: $Date$ Author: paul@prescod.net (Paul Prescod) Status: Active Type: Process Created: 26-Oct-2000 Post-History:

source: PEP: 6 Title: Bug Fix Releases Version: $Revision$ Last-Modified: $Date$ Author: aahz@pythoncraft.com (Aahz), anthony@interlink.com.au (Anthony Baxter) Status: Active Type: Process Created: 15-Mar-2001 Post-History: 15-Mar-2001 18-Apr-2001 19-Aug-2004
ko: PEP: 6 Title: 버그 수정 릴리스 Version: $Revision$ Last-Modified: $Date$ Author: aahz@pythoncraft.com (Aahz), anthony@interlink.com.au (Anthony Baxter) Status: Active Type: Process Created: 15-Mar-2001 Post-History: 15-Mar-2001 18-Apr-2001 19-Aug-2004

source: PEP: 7 Title: Style Guide for C Code Version: $Revision$ Last-Modified: $Date$ Author: Guido van Rossum <guido@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Jul-2001 Post-History:
ko: PEP: 7 Title: C 코드 스타일 안내 Version: $Revision$ Last-Modified: $Date$ Author: Guido van Rossum <guido@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Jul-2001 Post-History:

source: PEP: 8 Title: Style Guide for Python Code Version: $Revision$ Last-Modified: $Date$ Author: Guido van Rossum <guido@python.org>, Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Jul-2001 Post-History: 05-Jul-2001
ko: PEP: 8 Title: 파이썬 코드 스타일 안내 Version: $Revision$ Last-Modified: $Date$ Author: Guido van Rossum <guido@python.org>, Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Jul-2001 Post-History: 05-Jul-2001

source: PEP: 9 Title: Sample Plaintext PEP Template Version: $Revision$ Last-Modified: $Date$ Author: Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/plain Created: 14-Aug-2001 Post-History:
ko: PEP: 9 Title: 일반텍스트 PEP 템플릿 견본 Version: $Revision$ Last-Modified: $Date$ Author: Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/plain Created: 14-Aug-2001 Post-History:

source: PEPs can also be superseded by a different PEP, rendering the original obsolete. This is intended for Informational PEPs, where version 2 of an API can replace version 1.
ko: PEP는 원래의 것을 쓸모 없게 만드는 다른 PEP로 대체될 수도 있다. 이것은 정보 PEP를 위한 것으로, 어떤 API의 버전 2는 버전 1을 대신할 수 있다.

source: PEPs may also have a Superseded-By header indicating that a PEP has been rendered obsolete by a later document; the value is the number of the PEP that replaces the current document. The newer PEP must have a Replaces header containing the number of the PEP that it rendered obsolete.
ko: Superseded-By 헤더는 이후의 문서에 의해 불필요하게 되었음을 가리키며, 현재의 문서를 대체하는 PEP의 번호를 기록한다. 이 경우 새로운 PEP는 반드시 Replaces 헤더에 불필요하게 된 PEP의 번호를 기록한다.

source: PEPs may have a Requires header, indicating the PEP numbers that this PEP depends on.
ko: 다른 PEP에 대한 의존성을 가지는 경우, 그 번호를 Requires 헤더에 기록한다.

source: PEPs may include auxiliary files such as diagrams. Such files must be named ``pep-XXXX-Y.ext``, where "XXXX" is the PEP number, "Y" is a serial number (starting at 1), and "ext" is replaced by the actual file extension (e.g. "png").
ko: PEP에는 다이어그램과 같이 보조적인 파일이 포함될 수 있다. 그러한 파일에는 ``pep-XXXX-Y.ext``\ 와 같이 이름을 붙이며, "XXXX"는 PEP 번호, "Y"는 일련번호(1부터 시작), "ext"는 실제 파일 확장자("png" 등)로 치환한다.

source: Package and Module Names ~~~~~~~~~~~~~~~~~~~~~~~~
ko: 패키지와 모듈 이름 ~~~~~~~~~~~~~~~~~~

source: Paragraphs inside a block comment are separated by a line containing a single ``#``.
ko: 블록 주석문 내부의 문단들은 한 개의 ``#`` 문자를 포함한 빈 줄을 넣어 구분한다.

source: Perl Documentation
ko: Perl 문서

source: Pet Peeves ----------
ko: 눈엣가시 --------

source: Plaintext PEPs are written with minimal structural markup that adheres to a rigid style. PEP 9 contains a instructions and a template [3]_ you can use to get started writing your plaintext PEP.
ko: 일반 텍스트 PEP는 엄격한 스타일을 따르는 최소한의 구조적 마크업으로 작성된다. PEP 9에 일반 텍스트 PEP를 작성하는 방법에 대한 설명 및 템플릿\ [3]_\ 이 있다.

source: Prescriptive: Naming Conventions --------------------------------
ko: 규정: 명명 규칙 ---------------

source: Problem
ko: 문제

source: Problems
ko: 문제점

source: Procedure
ko: 절차

source: Procedure for declaring a module deprecated
ko: 모듈 금지를 선언하는 절차

source: Programming Recommendations ===========================
ko: 프로그래밍 권장사항 ===================

source: Prohibitions
ko: 금지사항

source: Proposal
ko: 제안

source: Proposal:
ko: 제안:

source: Proposed Implementation There is a new object type called an attribute access handler. Objects of this type have the following attributes:
ko: 구현 제안 There is a new object type called an attribute access handler. Objects of this type have the following attributes:

source: Proposed Interface
ko: 제안된 인터페이스

source: Proposed Resolutions
ko: 제안된 해결책

source: Proposed Solution
ko: 제안된 해결책

source: Proposed Syntax Special methods should declare themselves with declarations of the following form:
ko: 제안 구문 Special methods should declare themselves with declarations of the following form:

source: Public attributes are those that you expect unrelated clients of your class to use, with your commitment to avoid backward incompatible changes. Non-public attributes are those that are not intended to be used by third parties; you make no guarantees that non-public attributes won't change or even be removed.
ko: public 어트리뷰트는 당신이 만든 클래스를 사용하는 클라이언트들이 실제로 접근하게 될 어트리뷰트로, 하위 호환성 유지를 고려해야 한다. 비 public 어트리뷰트는 서드 파티가 사용할 수 없도록 설계된 어트리뷰트이다. 비 public 어트리뷰트는 이후에 변경되거나 제거할 수 있다.

source: Put any relevant ``__all__`` specification after the imports.
ko: 임포트 구문 다음에는 ``__all__`` 명세를 넣는다.

source: Python Docstring Goals
ko: Python Docstring 목표

source: Python accepts the control-L (i.e. ^L) form feed character as whitespace; Many tools treat these characters as page separators, so you may use them to separate pages of related sections of your file. Note, some editors and web-based code viewers may not recognize control-L as a form feed and will show another glyph in its place.
ko: 파이썬은 컨트롤-L(^L) 폼 피드 문자를 공백으로 취급한다. 많은 프로그램이 이 문자를 페이지 구분자로 취급하며, 파일 내에서 서로 연관성이 있는 단락을 페이지별로 구분하는데 이 문자를 사용할 수 있다. 특정 편집기나 웹 기반의 코드 뷰어는 컨트롤-L을 폼 피드 문자로 인식하지 않을 수도 있으며, 이 경우 폼 피드를 대신하는 다른 문자가 컨트롤-L 문자의 위치에 표시될 것이다.

source: Python coders from non-English speaking countries: please write your comments in English, unless you are 120% sure that the code will never be read by people who don't speak your language.
ko: 비영어권 국가의 파이썬 코더의 경우, 다른 나라의 개발자가 현재 당신이 작성하는 코드를 읽게 될 일이 전혀 없으리란 확신이 들지 않는다면, 부 디 영문으로 주석을 작성해주길 바란다.

source: Python mangles these names with the class name: if class Foo has an attribute named ``__a``, it cannot be accessed by ``Foo.__a``. (An insistent user could still gain access by calling ``Foo._Foo__a``.) Generally, double leading underscores should be used only to avoid name conflicts with attributes in classes designed to be subclassed.
ko: 파이썬은 이러한 이름에 클래스 이름을 결합하여 네임 맹글링을 수행한다 : 만약 Foo 클래스가 ``__a``\ 라는 이름의 어트리뷰트를 갖고 있다면, 이 어트리뷰트는 ``Foo.__a`` 같은 코드로 접근할 수 없다. (집요한 사용자라면 ``Foo._Foo__a``\ 를 호출하여 이 어트리뷰트에 접근할 수 있다.) 일반적으로 두 개의 언더스코어 문자를 앞에 붙이는 방법은 상속이 일어나도록 설계된 클래스 내의 어트리뷰트에서 일어나는 이름 충돌을 피할 때에만 사용해야 한다.

source: Python's BDFL -------------
ko: 파이썬의 BDFL -------------

source: Rather not::
ko: 권장하지 않음::

source: Rationale
ko: 근거

source: Rationale ---------
ko: 근거 ----

source: Rationale =========
ko: 근거 ====

source: ReStructuredText PEP Formatting Requirements ============================================
ko: ReStructuredText PEP Formatting 요건 ====================================

source: ReStructuredText_ PEPs allow for rich markup that is still quite easy to read, but results in much better-looking and more functional HTML. PEP 12 contains instructions and a template [4]_ for reStructuredText PEPs.
ko: ReStructuredText_ PEP는 다양한 markup을 사용하여, 여전히 읽기는 쉬우면서도 더 보기 좋고 기능적인 HTML을 만들어낼 수 있다. PEP 12에 reStructuredText PEP를 작성하는 방법에 대한 설명과 템플릿\ [4]_\ 이 있다.

source: Reference Implementation
ko: 참조 구현

source: References
ko: 참조

source: References ==========
ko: 참조 ====

source: References ----------
ko: 참조 ----

source: References and Footnotes ========================
ko: 참조 및 각주 ============

source: Rejected Changes
ko: 변경 거부

source: Related PEPs
ko: 관련된 PEP

source: Release Manager
ko: 릴리스 관리자

source: Release Schedule
ko: 릴리스 일정

source: Release Schedule [revised 5 Oct 2000]
ko: 릴리스 일정 [revised 5 Oct 2000]

source: Replacement Note
ko: 대체 노트

source: Reporting PEP Bugs, or Submitting PEP Updates =============================================
ko: PEP 버그 보고 및 PEP 수정 제출 ==============================

source: Resources =========
ko: 자원 ====

source: Resources:
ko: 자원:

source: Scenario 1:
ko: 시나리오 1:

source: Scenario 2:
ko: 시나리오 2:

source: Scenario 3:
ko: 시나리오 3:

source: Schedule
ko: 일정

source: Scope
ko: 범위

source: Security Issues
ko: 보안 이슈

source: Semantics
ko: 시맨틱

source: Semantics Attribute references of all three kinds should call the method. The op parameter can be "get"/"set"/"del". Of course this string will be interned so the actual checks for the string will be very fast. It is disallowed to actually have an attribute named XXX in the same instance as a method named __attr_XXX__.
ko: 시맨틱 Attribute references of all three kinds should call the method. The op parameter can be "get"/"set"/"del". Of course this string will be interned so the actual checks for the string will be very fast. It is disallowed to actually have an attribute named XXX in the same instance as a method named __attr_XXX__.

source: Separate top-level function and class definitions with two blank lines.
ko: 최상위 수준 함수와 클래스 정의는 두 줄을 띄워서 구분한다.

source: Since module names are mapped to file names, and some file systems are case insensitive and truncate long names, it is important that module names be chosen to be fairly short -- this won't be a problem on Unix, but it may be a problem when the code is transported to older Mac or Windows versions, or DOS.
ko: 위와 같이 하는 이유는 모듈 이름이 파일 이름에 직접적으로 대응되며, 특정한 파일 시스템에서는 대소문자가 무시되고 긴 이름이 잘려나가기 때문이다. 그러므로 모듈 이름을 가급적 짧게 짓는 것은 중요한 일이다 -- 유닉스 시스템에서는 별 문제가 없겠지만 구형 맥, 윈도우, 도스 등으로 이 코드를 옮겼을 때 문제가 될 수 있다.

source: Software covered by the GNU General Public License
ko: GNU 공중 라이선스를 따르는 소프트웨어

source: Solution
ko: 해결 방안

source: Some Informational and Process PEPs may also have a status of "Active" if they are never meant to be completed. E.g. PEP 1 (this PEP).
ko: 의도적으로 완료시키지 않는 몇몇 정보 및 프로세스 PEP는 "활성(Active)" 상태를 가질 수 있다. 지금 보고 있는 PEP 1이 그 예이다.

source: Specification
ko: 명세

source: Standard Library
ko: 표준 라이브러리

source: Standards Track PEPs consist of two parts, a design document and a reference implementation. It is generally recommended that at least a prototype implementation be co-developed with the PEP, as ideas that sound good in principle sometimes turn out to be impractical when subjected to the test of implementation.
ko: 표준 트랙 PEP는 설계 문서와 참조 구현의 두 부분으로 이루어진다. 일반적으로 최소한 프로토타입 구현을 PEP와 함께 개발하는 것을 권장하는데, 이는 이론적으로는 괜찮아보이는 아이디어가 실제 구현을 테스트해보면 실용적이지 못한 것으로 판명되는 경우가 있기 때문이다.

source: Standards Track PEPs will typically have a Python-Version header which indicates the version of Python that the feature will be released with. Standards Track PEPs without a Python-Version header indicate interoperability standards that will initially be supported through external libraries and tools, and then supplemented by a later PEP to add support to the standard library. Informational and Process PEPs do not need a Python-Version header.
ko: 표준 트랙 PEP는 일반적으로 그 기능이 릴리스될 파이썬 버전을 가리키는 Python-Version 헤더를 갖는다. Python-Version 헤더가 없는 표준 트랙 PEP는, 처음에는 외부 라이브러리 및 도구를 통해 상호 운용이 가능한 표준으로 하였다가, 나중에 표준 라이브러리에 포함시키는 경우이다. 정보 및 프로세스 PEP에는 Python-Version 헤더가 필요하지 않다.

source: Steps For Introducing Backwards-Incompatible Features
ko: 하위 호환되지 않는 기능을 도입하기 위한 절차

source: String exceptions in new code are forbidden, and this language feature has been removed in Python 2.6.
ko: 앞으로 작성되는 코드에서는 문자열 예외가 금지되며, 문자열 예외 기능은 파이썬 2.6에서 제거되었다.

source: String methods are always much faster and share the same API with unicode strings. Override this rule if backward compatibility with Pythons older than 2.0 is required.
ko: 문자열 메서드는 항상 좀 더 빠르며 유니코드 문자열과 동일한 API를 공유하고 있다. 파이썬 2.0 이하 버전과의 하위 호환성이 필요한 경우에는 이 규칙을 무시해도 된다.

source: Submitting a PEP ----------------
ko: PEP 제출 --------

source: Syntax
ko: 구문

source: Tables ------
ko: 표 --

source: Tabs or Spaces? ---------------
ko: 탭이냐 공백이냐 ---------------

source: The Author header lists the names, and optionally the email addresses of all the authors/owners of the PEP. The format of the Author header value must be
ko: Author 헤더에는 PEP 저자 및 소유자의 이름을 나열하며, 이메일 주소를 함께 쓸 수 있다. Author 헤더의 값은 반드시 다음과 같은 형식으로 기재한다.

source: The BDFL-Delegate field is used to record cases where the final decision to approve or reject a PEP rests with someone other than the BDFL. (The delegate's email address is currently omitted due to a limitation in the email address masking for reStructuredText PEPs)
ko: BDFL-Delegate 필드는 PEP의 수용 또는 거부에 대한 최종 결정을 BDFL이 아닌 다른 사람에게 위임한 경우에 사용한다. (위임받은 이의 이메일 주소는 현재 reStructuredText PEP의 이메일 주소 마스킹의 제약으로 인해 생략한다.)

source: The Created header records the date that the PEP was assigned a number, while Post-History is used to record the dates of when new versions of the PEP are posted to python-list and/or python-dev. Both headers should be in dd-mmm-yyyy format, e.g. 14-Aug-2001.
ko: Created 헤더에는 PEP 번호를 부여한 날짜를 기록하고, Post-History는 새로운 버전의 PEP가 python-list 및 python-dev에 게재된 날짜를 기록한다. 두 헤더는 dd-mmm-yyyy 형식을 따르며, 14-Aug-2001과 같이 쓴다.

source: The PEP editors are individuals responsible for managing the administrative and editorial aspects of the PEP workflow (e.g. assigning PEP numbers and changing their status). See `PEP Editor Responsibilities & Workflow`_ for details. The current editors are:
ko: PEP 편집자는 PEP 흐름의 관리 및 편집(PEP 번호를 할당하고 각각의 상태를 변경하는 일 등)에 대한 책임을 맡는 개인이다. 자세한 내용은 `PEP 편집자의 책임 및 흐름`_\ 을 참조하라. 현재 활동 중인 편집자는 다음과 같다.

source: The PEP process begins with a new idea for Python. It is highly recommended that a single PEP contain a single key proposal or new idea. Small enhancements or patches often don't need a PEP and can be injected into the Python development workflow with a patch submission to the Python `issue tracker`_. The more focused the PEP, the more successful it tends to be. The PEP editors reserve the right to reject PEP proposals if they appear too unfocused or too broad. If in doubt, split your PEP into several well-focused ones.
ko: PEP 프로세스는 파이썬에 대한 새로운 아이디어로부터 시작한다. 단일한 PEP는 단 하나의 주요 제안 또는 새로운 아이디어만을 담도록 하는 것을 강력히 권장한다. 사소한 개선이나 패치는 종종 PEP를 거치지 않고 파이썬 `이슈 트래커`_\ 에 패치를 제출함으로써 파이썬 개발 흐름에 포함시킬 수 있다. PEP는 초점이 잘 잡혀 있을 수록 성공하기 쉽다. PEP 편집자는 초점이 맞지 않거나 너무 광범위한 PEP를 거부할 수 있다. 의심스럽다면 PEP를 초점이 잘 잡힌 여러 개의 PEP로 분할하도록 하라.

source: The Proposed Solution
ko: 제안된 해결책

source: The Type header specifies the type of PEP: Standards Track, Informational, or Process.
ko: Type 헤더에는 Standards Track(표준 트랙), Informational(정보) 또는 Process(프로세스) 등과 같이 PEP의 종류를 기재한다.

source: The X11 library uses a leading X for all its public functions. In Python, this style is generally deemed unnecessary because attribute and method names are prefixed with an object, and function names are prefixed with a module name.
ko: X11 라이브러리는 public 함수에 모두 X라는 접두사를 사용하고 있다. 파이썬에서 이러한 스타일은 일반적으로 쓸데없는 짓으로 간주된다. 어트리뷰트와 메서드에 접근할 때에는 객체를 접두사로 사용하며, 함수에 접근할 때에는 모듈 이름을 접두사로 사용하기 때문이다.

source: The Zen of Python
ko: 파이썬 선(禪)

source: The closing brace/bracket/parenthesis on multi-line constructs may either line up under the last item of the list, as in::
ko: 여러 줄에 걸친 괄호/중괄호/대괄호를 닫을 경우 리스트의 마지막 항목에 맞추어 다음 줄에 닫는 표시를 할 수 있다. 다음 코드를 보자. ::

source: The exception is if your code must work with Python 1.5.2 (but let's hope not!).
ko: 예외적으로, 파이썬 1.5.2에서 동작하는 코드를 작성해야 할 경우는 후자의 코드를 사용한다(그런 일이 없기를!).

source: The final authority for PEP approval is the BDFL. However, whenever a new PEP is put forward, any core developer that believes they are suitably experienced to make the final decision on that PEP may offer to serve as the BDFL's delegate (or "PEP czar") for that PEP. If their self-nomination is accepted by the other core developers and the BDFL, then they will have the authority to approve (or reject) that PEP. This process happens most frequently with PEPs where the BDFL has granted in principle approval for *something* to be done, but there are details that need to be worked out before the PEP can be accepted.
ko: PEP 승인의 최종 결정권자는 BDFL이다. 그러나, 새로운 PEP마다, 충분한 경험을 갖추고 최종 결정을 내릴 수 있는 핵심 개발자가 BDFL의 위임자(또는 "PEP 황제")로서 봉사할 수 있다. 그들의 자기 추천이 다른 핵심 개발자와 BDFL에 의해 받아들여지면, 해당 PEP에 대한 승인(또는 거부)의 권한을 갖게 된다. 이 프로세스는 BDFL이 *무언가가* 이루어지는 데에 원칙적으로는 수용을 허락하였지만, 그 PEP를 수용하기 위해 해야할 일들이 남아있는 경우에 자주 일어난다.

source: The final implementation must include test code and documentation appropriate for either the Python language reference or the standard library reference.
ko: 최종 구현은 테스트 코드와 함께, 파이썬 언어 레퍼런스 또는 표준 라이브러리 레퍼런스에 적합한 문서를 반드시 포함하여야 한다.

source: The following is a PEP-specific summary of reStructuredText syntax. For the sake of simplicity and brevity, much detail is omitted. For more detail, see `Resources`_ below. `Literal blocks`_ (in which no markup processing is done) are used for examples throughout, to illustrate the plaintext markup.
ko: The following is a PEP-specific summary of reStructuredText syntax. For the sake of simplicity and brevity, much detail is omitted. For more detail, see `자원`_ below. `Literal blocks`_ (in which no markup processing is done) are used for examples throughout, to illustrate the plaintext markup.

source: The following naming styles are commonly distinguished:
ko: 다음과 같은 명명 스타일을 흔히 볼 수 있다.

source: The format of a PEP is specified with a Content-Type header. The acceptable values are "text/plain" for plaintext PEPs (see PEP 9 [3]_) and "text/x-rst" for reStructuredText PEPs (see PEP 12 [4]_). Plaintext ("text/plain") is the default if no Content-Type header is present.
ko: PEP의 형식은 Content-Type 헤더에 지정한다. 사용할 수 있는 값으로는 일반 텍스트 PEP를 의미하는 "text/plain"(PEP 9 참조 [3]_)와 reStructuredText PEP를 의미하는 "text/x-rst"(PEP 12 참조 [4]_ )가 있다. Content-Type 헤더를 지정하지 않은 경우에는 일반 텍스트("text/plain")를 기본값으로 한다.

source: The latest version of this document is always available at:
ko: 이 문서의 최종 버전은 다음 주소에서 항상 볼 수 있다.

source: The latter example doesn't provide any information to indicate that the __enter__ and __exit__ methods are doing something other than closing the connection after a transaction. Being explicit is important in this case.
ko: 후자의 예를 살펴보면 __enter__, __exit__ 메서드가 트랜잭션 이후에 커넥션을 닫는다는 것 외에는 어떤 일을 하는지에 대한 정보를 제공하지 않는 것을 볼 수 있다. 이러한 경우 명시적인 정보를 제공하는 것은 중요하다.

source: The mercurial repo for the peps is::
ko: PEP 머큐리얼 저장소::

source: The most popular way of indenting Python is with spaces only. The second-most popular way is with tabs only. Code indented with a mixture of tabs and spaces should be converted to using spaces exclusively. When invoking the Python command line interpreter with the ``-t`` option, it issues warnings about code that illegally mixes tabs and spaces. When using ``-tt`` these warnings become errors. These options are highly recommended!
ko: 파이썬에서 들여쓰기에 주로 사용되는 방식은 공백 문자만 사용하는 것이다. 두 번째로 많이 쓰이는 방식은 탭 문자만 사용하는 것이다. 탭 문자와 공백 문자가 섞인 코드는 반드시 공백 문자만 사용한 코드로 변환해야 한다. ``-t`` 옵션을 사용하여 파이썬 명령줄 인터프리터를 호출하면 탭 문자와 공백 문자가 섞인 코드가 있을 경우 인터프리터가 경고 메시지를 표시한다. ``-tt`` 옵션을 사용하면 이 경고 메시지가 에러 메시지로 표시된다. 위 옵션들을 사용하기를 권한다.

source: The naming conventions of Python's library are a bit of a mess, so we'll never get this completely consistent -- nevertheless, here are the currently recommended naming standards. New modules and packages (including third party frameworks) should be written to these standards, but where an existing library has a different style, internal consistency is preferred.
ko: 파이썬 라이브러리의 명명 규칙은 난잡하기 때문에, 이 라이브러리에 완벽하게 일관성을 적용하는 일은 없을 것이다. 어쨌든, 현재 권장되는 명명 규칙에 대한 표준을 여기 기술한다. 새로운 모듈과 패키지(서드 파티 프레임워크를 포함한)는 이들 표준에 맞추어 작성되어야 하지만, 이미 다른 스타일로 작성되어 있는 기존 라이브러리는 그 자체의 일관성을 유지하도록 한다.

source: The paren-using form is preferred because when the exception arguments are long or include string formatting, you don't need to use line continuation characters thanks to the containing parentheses. The older form is not legal syntax in Python 3.
ko: 괄호를 사용하는 구문을 권장하는 이유는, 예외의 인수가 긴 문자열이거나 문자열 형식화를 사용할 경우에 여러 줄을 이어서 작성하기가 좀 더 편리하기 때문이다. 파이썬 3에서 괄호를 사용하지 않은 예외 발생 구문은 틀린 문법이다.

source: The possible paths of the status of PEPs are as follows:
ko: PEP가 가질 수 있는 상태는 다음과 같다.
